{"class_name": "Model", "config": {"name": "efficientnet-b1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 240, 240, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "stem_conv", "class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "stem_bn", "class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_conv", 0, 0, {}]]]}, {"name": "stem_activation", "class_name": "Activation", "config": {"name": "stem_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["stem_bn", 0, 0, {}]]]}, {"name": "block1a_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block1a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["stem_activation", 0, 0, {}]]]}, {"name": "block1a_bn", "class_name": "BatchNormalization", "config": {"name": "block1a_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block1a_dwconv", 0, 0, {}]]]}, {"name": "block1a_activation", "class_name": "Activation", "config": {"name": "block1a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block1a_bn", 0, 0, {}]]]}, {"name": "block1a_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block1a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block1a_activation", 0, 0, {}]]]}, {"name": "block1a_se_reshape", "class_name": "Reshape", "config": {"name": "block1a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 32]}, "inbound_nodes": [[["block1a_se_squeeze", 0, 0, {}]]]}, {"name": "block1a_se_reduce", "class_name": "Conv2D", "config": {"name": "block1a_se_reduce", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1a_se_reshape", 0, 0, {}]]]}, {"name": "block1a_se_expand", "class_name": "Conv2D", "config": {"name": "block1a_se_expand", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1a_se_reduce", 0, 0, {}]]]}, {"name": "block1a_se_excite", "class_name": "Multiply", "config": {"name": "block1a_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block1a_activation", 0, 0, {}], ["block1a_se_expand", 0, 0, {}]]]}, {"name": "block1a_project_conv", "class_name": "Conv2D", "config": {"name": "block1a_project_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1a_se_excite", 0, 0, {}]]]}, {"name": "block1a_project_bn", "class_name": "BatchNormalization", "config": {"name": "block1a_project_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block1a_project_conv", 0, 0, {}]]]}, {"name": "block1b_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block1b_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block1a_project_bn", 0, 0, {}]]]}, {"name": "block1b_bn", "class_name": "BatchNormalization", "config": {"name": "block1b_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block1b_dwconv", 0, 0, {}]]]}, {"name": "block1b_activation", "class_name": "Activation", "config": {"name": "block1b_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block1b_bn", 0, 0, {}]]]}, {"name": "block1b_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block1b_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block1b_activation", 0, 0, {}]]]}, {"name": "block1b_se_reshape", "class_name": "Reshape", "config": {"name": "block1b_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 16]}, "inbound_nodes": [[["block1b_se_squeeze", 0, 0, {}]]]}, {"name": "block1b_se_reduce", "class_name": "Conv2D", "config": {"name": "block1b_se_reduce", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1b_se_reshape", 0, 0, {}]]]}, {"name": "block1b_se_expand", "class_name": "Conv2D", "config": {"name": "block1b_se_expand", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1b_se_reduce", 0, 0, {}]]]}, {"name": "block1b_se_excite", "class_name": "Multiply", "config": {"name": "block1b_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block1b_activation", 0, 0, {}], ["block1b_se_expand", 0, 0, {}]]]}, {"name": "block1b_project_conv", "class_name": "Conv2D", "config": {"name": "block1b_project_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1b_se_excite", 0, 0, {}]]]}, {"name": "block1b_project_bn", "class_name": "BatchNormalization", "config": {"name": "block1b_project_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block1b_project_conv", 0, 0, {}]]]}, {"name": "block1b_drop", "class_name": "FixedDropout", "config": {"name": "block1b_drop", "trainable": true, "dtype": "float32", "rate": 0.0125, "noise_shape": [null, 1, 1, 1], "seed": null}, "inbound_nodes": [[["block1b_project_bn", 0, 0, {}]]]}, {"name": "block1b_add", "class_name": "Add", "config": {"name": "block1b_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block1b_drop", 0, 0, {}], ["block1a_project_bn", 0, 0, {}]]]}, {"name": "block2a_expand_conv", "class_name": "Conv2D", "config": {"name": "block2a_expand_conv", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1b_add", 0, 0, {}]]]}, {"name": "block2a_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2a_expand_conv", 0, 0, {}]]]}, {"name": "block2a_expand_activation", "class_name": "Activation", "config": {"name": "block2a_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block2a_expand_bn", 0, 0, {}]]]}, {"name": "block2a_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block2a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block2a_expand_activation", 0, 0, {}]]]}, {"name": "block2a_bn", "class_name": "BatchNormalization", "config": {"name": "block2a_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2a_dwconv", 0, 0, {}]]]}, {"name": "block2a_activation", "class_name": "Activation", "config": {"name": "block2a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block2a_bn", 0, 0, {}]]]}, {"name": "block2a_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block2a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block2a_activation", 0, 0, {}]]]}, {"name": "block2a_se_reshape", "class_name": "Reshape", "config": {"name": "block2a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 96]}, "inbound_nodes": [[["block2a_se_squeeze", 0, 0, {}]]]}, {"name": "block2a_se_reduce", "class_name": "Conv2D", "config": {"name": "block2a_se_reduce", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2a_se_reshape", 0, 0, {}]]]}, {"name": "block2a_se_expand", "class_name": "Conv2D", "config": {"name": "block2a_se_expand", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2a_se_reduce", 0, 0, {}]]]}, {"name": "block2a_se_excite", "class_name": "Multiply", "config": {"name": "block2a_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block2a_activation", 0, 0, {}], ["block2a_se_expand", 0, 0, {}]]]}, {"name": "block2a_project_conv", "class_name": "Conv2D", "config": {"name": "block2a_project_conv", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2a_se_excite", 0, 0, {}]]]}, {"name": "block2a_project_bn", "class_name": "BatchNormalization", "config": {"name": "block2a_project_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2a_project_conv", 0, 0, {}]]]}, {"name": "block2b_expand_conv", "class_name": "Conv2D", "config": {"name": "block2b_expand_conv", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2a_project_bn", 0, 0, {}]]]}, {"name": "block2b_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2b_expand_conv", 0, 0, {}]]]}, {"name": "block2b_expand_activation", "class_name": "Activation", "config": {"name": "block2b_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block2b_expand_bn", 0, 0, {}]]]}, {"name": "block2b_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block2b_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block2b_expand_activation", 0, 0, {}]]]}, {"name": "block2b_bn", "class_name": "BatchNormalization", "config": {"name": "block2b_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2b_dwconv", 0, 0, {}]]]}, {"name": "block2b_activation", "class_name": "Activation", "config": {"name": "block2b_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block2b_bn", 0, 0, {}]]]}, {"name": "block2b_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block2b_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block2b_activation", 0, 0, {}]]]}, {"name": "block2b_se_reshape", "class_name": "Reshape", "config": {"name": "block2b_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 144]}, "inbound_nodes": [[["block2b_se_squeeze", 0, 0, {}]]]}, {"name": "block2b_se_reduce", "class_name": "Conv2D", "config": {"name": "block2b_se_reduce", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2b_se_reshape", 0, 0, {}]]]}, {"name": "block2b_se_expand", "class_name": "Conv2D", "config": {"name": "block2b_se_expand", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2b_se_reduce", 0, 0, {}]]]}, {"name": "block2b_se_excite", "class_name": "Multiply", "config": {"name": "block2b_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block2b_activation", 0, 0, {}], ["block2b_se_expand", 0, 0, {}]]]}, {"name": "block2b_project_conv", "class_name": "Conv2D", "config": {"name": "block2b_project_conv", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2b_se_excite", 0, 0, {}]]]}, {"name": "block2b_project_bn", "class_name": "BatchNormalization", "config": {"name": "block2b_project_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2b_project_conv", 0, 0, {}]]]}, {"name": "block2b_drop", "class_name": "FixedDropout", "config": {"name": "block2b_drop", "trainable": true, "dtype": "float32", "rate": 0.037500000000000006, "noise_shape": [null, 1, 1, 1], "seed": null}, "inbound_nodes": [[["block2b_project_bn", 0, 0, {}]]]}, {"name": "block2b_add", "class_name": "Add", "config": {"name": "block2b_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block2b_drop", 0, 0, {}], ["block2a_project_bn", 0, 0, {}]]]}, {"name": "block2c_expand_conv", "class_name": "Conv2D", "config": {"name": "block2c_expand_conv", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2b_add", 0, 0, {}]]]}, {"name": "block2c_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block2c_expand_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2c_expand_conv", 0, 0, {}]]]}, {"name": "block2c_expand_activation", "class_name": "Activation", "config": {"name": "block2c_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block2c_expand_bn", 0, 0, {}]]]}, {"name": "block2c_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block2c_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block2c_expand_activation", 0, 0, {}]]]}, {"name": "block2c_bn", "class_name": "BatchNormalization", "config": {"name": "block2c_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2c_dwconv", 0, 0, {}]]]}, {"name": "block2c_activation", "class_name": "Activation", "config": {"name": "block2c_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block2c_bn", 0, 0, {}]]]}, {"name": "block2c_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block2c_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block2c_activation", 0, 0, {}]]]}, {"name": "block2c_se_reshape", "class_name": "Reshape", "config": {"name": "block2c_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 144]}, "inbound_nodes": [[["block2c_se_squeeze", 0, 0, {}]]]}, {"name": "block2c_se_reduce", "class_name": "Conv2D", "config": {"name": "block2c_se_reduce", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2c_se_reshape", 0, 0, {}]]]}, {"name": "block2c_se_expand", "class_name": "Conv2D", "config": {"name": "block2c_se_expand", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2c_se_reduce", 0, 0, {}]]]}, {"name": "block2c_se_excite", "class_name": "Multiply", "config": {"name": "block2c_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block2c_activation", 0, 0, {}], ["block2c_se_expand", 0, 0, {}]]]}, {"name": "block2c_project_conv", "class_name": "Conv2D", "config": {"name": "block2c_project_conv", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2c_se_excite", 0, 0, {}]]]}, {"name": "block2c_project_bn", "class_name": "BatchNormalization", "config": {"name": "block2c_project_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2c_project_conv", 0, 0, {}]]]}, {"name": "block2c_drop", "class_name": "FixedDropout", "config": {"name": "block2c_drop", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": [null, 1, 1, 1], "seed": null}, "inbound_nodes": [[["block2c_project_bn", 0, 0, {}]]]}, {"name": "block2c_add", "class_name": "Add", "config": {"name": "block2c_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block2c_drop", 0, 0, {}], ["block2b_add", 0, 0, {}]]]}, {"name": "block3a_expand_conv", "class_name": "Conv2D", "config": {"name": "block3a_expand_conv", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2c_add", 0, 0, {}]]]}, {"name": "block3a_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block3a_expand_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block3a_expand_conv", 0, 0, {}]]]}, {"name": "block3a_expand_activation", "class_name": "Activation", "config": {"name": "block3a_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block3a_expand_bn", 0, 0, {}]]]}, {"name": "block3a_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block3a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block3a_expand_activation", 0, 0, {}]]]}, {"name": "block3a_bn", "class_name": "BatchNormalization", "config": {"name": "block3a_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block3a_dwconv", 0, 0, {}]]]}, {"name": "block3a_activation", "class_name": "Activation", "config": {"name": "block3a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block3a_bn", 0, 0, {}]]]}, {"name": "block3a_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block3a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block3a_activation", 0, 0, {}]]]}, {"name": "block3a_se_reshape", "class_name": "Reshape", "config": {"name": "block3a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 144]}, "inbound_nodes": [[["block3a_se_squeeze", 0, 0, {}]]]}, {"name": "block3a_se_reduce", "class_name": "Conv2D", "config": {"name": "block3a_se_reduce", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3a_se_reshape", 0, 0, {}]]]}, {"name": "block3a_se_expand", "class_name": "Conv2D", "config": {"name": "block3a_se_expand", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3a_se_reduce", 0, 0, {}]]]}, {"name": "block3a_se_excite", "class_name": "Multiply", "config": {"name": "block3a_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block3a_activation", 0, 0, {}], ["block3a_se_expand", 0, 0, {}]]]}, {"name": "block3a_project_conv", "class_name": "Conv2D", "config": {"name": "block3a_project_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3a_se_excite", 0, 0, {}]]]}, {"name": "block3a_project_bn", "class_name": "BatchNormalization", "config": {"name": "block3a_project_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block3a_project_conv", 0, 0, {}]]]}, {"name": "block3b_expand_conv", "class_name": "Conv2D", "config": {"name": "block3b_expand_conv", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3a_project_bn", 0, 0, {}]]]}, {"name": "block3b_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block3b_expand_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block3b_expand_conv", 0, 0, {}]]]}, {"name": "block3b_expand_activation", "class_name": "Activation", "config": {"name": "block3b_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block3b_expand_bn", 0, 0, {}]]]}, {"name": "block3b_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block3b_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block3b_expand_activation", 0, 0, {}]]]}, {"name": "block3b_bn", "class_name": "BatchNormalization", "config": {"name": "block3b_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block3b_dwconv", 0, 0, {}]]]}, {"name": "block3b_activation", "class_name": "Activation", "config": {"name": "block3b_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block3b_bn", 0, 0, {}]]]}, {"name": "block3b_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block3b_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block3b_activation", 0, 0, {}]]]}, {"name": "block3b_se_reshape", "class_name": "Reshape", "config": {"name": "block3b_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "inbound_nodes": [[["block3b_se_squeeze", 0, 0, {}]]]}, {"name": "block3b_se_reduce", "class_name": "Conv2D", "config": {"name": "block3b_se_reduce", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3b_se_reshape", 0, 0, {}]]]}, {"name": "block3b_se_expand", "class_name": "Conv2D", "config": {"name": "block3b_se_expand", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3b_se_reduce", 0, 0, {}]]]}, {"name": "block3b_se_excite", "class_name": "Multiply", "config": {"name": "block3b_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block3b_activation", 0, 0, {}], ["block3b_se_expand", 0, 0, {}]]]}, {"name": "block3b_project_conv", "class_name": "Conv2D", "config": {"name": "block3b_project_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3b_se_excite", 0, 0, {}]]]}, {"name": "block3b_project_bn", "class_name": "BatchNormalization", "config": {"name": "block3b_project_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block3b_project_conv", 0, 0, {}]]]}, {"name": "block3b_drop", "class_name": "FixedDropout", "config": {"name": "block3b_drop", "trainable": true, "dtype": "float32", "rate": 0.07500000000000001, "noise_shape": [null, 1, 1, 1], "seed": null}, "inbound_nodes": [[["block3b_project_bn", 0, 0, {}]]]}, {"name": "block3b_add", "class_name": "Add", "config": {"name": "block3b_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block3b_drop", 0, 0, {}], ["block3a_project_bn", 0, 0, {}]]]}, {"name": "block3c_expand_conv", "class_name": "Conv2D", "config": {"name": "block3c_expand_conv", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3b_add", 0, 0, {}]]]}, {"name": "block3c_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block3c_expand_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block3c_expand_conv", 0, 0, {}]]]}, {"name": "block3c_expand_activation", "class_name": "Activation", "config": {"name": "block3c_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block3c_expand_bn", 0, 0, {}]]]}, {"name": "block3c_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block3c_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block3c_expand_activation", 0, 0, {}]]]}, {"name": "block3c_bn", "class_name": "BatchNormalization", "config": {"name": "block3c_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block3c_dwconv", 0, 0, {}]]]}, {"name": "block3c_activation", "class_name": "Activation", "config": {"name": "block3c_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block3c_bn", 0, 0, {}]]]}, {"name": "block3c_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block3c_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block3c_activation", 0, 0, {}]]]}, {"name": "block3c_se_reshape", "class_name": "Reshape", "config": {"name": "block3c_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "inbound_nodes": [[["block3c_se_squeeze", 0, 0, {}]]]}, 