{"class_name": "Model", "config": {"name": "resnet152", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1_conv", "class_name": "Conv2D", "config": {"name": "conv1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"name": "conv1_bn", "class_name": "BatchNormalization", "config": {"name": "conv1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1_conv", 0, 0, {}]]]}, {"name": "conv1_relu", "class_name": "Activation", "config": {"name": "conv1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"name": "pool1_pad", "class_name": "ZeroPadding2D", "config": {"name": "pool1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv1_relu", 0, 0, {}]]]}, {"name": "pool1_pool", "class_name": "MaxPooling2D", "config": {"name": "pool1_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["pool1_pad", 0, 0, {}]]]}, {"name": "conv2_block1_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool1_pool", 0, 0, {}]]]}, {"name": "conv2_block1_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block1_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]]}, {"name": "conv2_block1_1_relu", "class_name": "Activation", "config": {"name": "conv2_block1_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]]}, {"name": "conv2_block1_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]]}, {"name": "conv2_block1_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block1_2_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block1_2_conv", 0, 0, {}]]]}, {"name": "conv2_block1_2_relu", "class_name": "Activation", "config": {"name": "conv2_block1_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block1_2_bn", 0, 0, {}]]]}, {"name": "conv2_block1_0_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_0_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool1_pool", 0, 0, {}]]]}, {"name": "conv2_block1_3_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_3_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block1_2_relu", 0, 0, {}]]]}, {"name": "conv2_block1_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block1_0_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block1_0_conv", 0, 0, {}]]]}, {"name": "conv2_block1_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block1_3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block1_3_conv", 0, 0, {}]]]}, {"name": "conv2_block1_add", "class_name": "Add", "config": {"name": "conv2_block1_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2_block1_0_bn", 0, 0, {}], ["conv2_block1_3_bn", 0, 0, {}]]]}, {"name": "conv2_block1_out", "class_name": "Activation", "config": {"name": "conv2_block1_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block1_add", 0, 0, {}]]]}, {"name": "conv2_block2_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block2_1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block1_out", 0, 0, {}]]]}, {"name": "conv2_block2_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block2_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]]}, {"name": "conv2_block2_1_relu", "class_name": "Activation", "config": {"name": "conv2_block2_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]]}, {"name": "conv2_block2_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block2_2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]]}, {"name": "conv2_block2_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block2_2_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block2_2_conv", 0, 0, {}]]]}, {"name": "conv2_block2_2_relu", "class_name": "Activation", "config": {"name": "conv2_block2_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block2_2_bn", 0, 0, {}]]]}, {"name": "conv2_block2_3_conv", "class_name": "Conv2D", "config": {"name": "conv2_block2_3_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block2_2_relu", 0, 0, {}]]]}, {"name": "conv2_block2_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block2_3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block2_3_conv", 0, 0, {}]]]}, {"name": "conv2_block2_add", "class_name": "Add", "config": {"name": "conv2_block2_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2_block1_out", 0, 0, {}], ["conv2_block2_3_bn", 0, 0, {}]]]}, {"name": "conv2_block2_out", "class_name": "Activation", "config": {"name": "conv2_block2_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block2_add", 0, 0, {}]]]}, {"name": "conv2_block3_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block3_1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block2_out", 0, 0, {}]]]}, {"name": "conv2_block3_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block3_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]]}, {"name": "conv2_block3_1_relu", "class_name": "Activation", "config": {"name": "conv2_block3_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]]}, {"name": "conv2_block3_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block3_2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]]}, {"name": "conv2_block3_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block3_2_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block3_2_conv", 0, 0, {}]]]}, {"name": "conv2_block3_2_relu", "class_name": "Activation", "config": {"name": "conv2_block3_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block3_2_bn", 0, 0, {}]]]}, {"name": "conv2_block3_3_conv", "class_name": "Conv2D", "config": {"name": "conv2_block3_3_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block3_2_relu", 0, 0, {}]]]}, {"name": "conv2_block3_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block3_3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block3_3_conv", 0, 0, {}]]]}, {"name": "conv2_block3_add", "class_name": "Add", "config": {"name": "conv2_block3_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2_block2_out", 0, 0, {}], ["conv2_block3_3_bn", 0, 0, {}]]]}, {"name": "conv2_block3_out", "class_name": "Activation", "config": {"name": "conv2_block3_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block3_add", 0, 0, {}]]]}, {"name": "conv3_block1_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block1_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block3_out", 0, 0, {}]]]}, {"name": "conv3_block1_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block1_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]]}, {"name": "conv3_block1_1_relu", "class_name": "Activation", "config": {"name": "conv3_block1_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]]}, {"name": "conv3_block1_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block1_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block1_1_relu", 0, 0, {}]]]}, {"name": "conv3_block1_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block1_2_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block1_2_conv", 0, 0, {}]]]}, {"name": "conv3_block1_2_relu", "class_name": "Activation", "config": {"name": "conv3_block1_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block1_2_bn", 0, 0, {}]]]}, {"name": "conv3_block1_0_conv", "class_name": "Conv2D", "config": {"name": "conv3_block1_0_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block3_out", 0, 0, {}]]]}, {"name": "conv3_block1_3_conv", "class_name": "Conv2D", "config": {"name": "conv3_block1_3_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block1_2_relu", 0, 0, {}]]]}, {"name": "conv3_block1_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block1_0_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block1_0_conv", 0, 0, {}]]]}, {"name": "conv3_block1_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block1_3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block1_3_conv", 0, 0, {}]]]}, {"name": "conv3_block1_add", "class_name": "Add", "config": {"name": "conv3_block1_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_block1_0_bn", 0, 0, {}], ["conv3_block1_3_bn", 0, 0, {}]]]}, {"name": "conv3_block1_out", "class_name": "Activation", "config": {"name": "conv3_block1_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block1_add", 0, 0, {}]]]}, {"name": "conv3_block2_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block2_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block1_out", 0, 0, {}]]]}, {"name": "conv3_block2_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block2_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]]}, {"name": "conv3_block2_1_relu", "class_name": "Activation", "config": {"name": "conv3_block2_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]]}, {"name": "conv3_block2_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block2_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block2_1_relu", 0, 0, {}]]]}, {"name": "conv3_block2_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block2_2_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block2_2_conv", 0, 0, {}]]]}, {"name": "conv3_block2_2_relu", "class_name": "Activation", "config": {"name": "conv3_block2_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block2_2_bn", 0, 0, {}]]]}, {"name": "conv3_block2_3_conv", "class_name": "Conv2D", "config": {"name": "conv3_block2_3_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block2_2_relu", 0, 0, {}]]]}, {"name": "conv3_block2_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block2_3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block2_3_conv", 0, 0, {}]]]}, {"name": "conv3_block2_add", "class_name": "Add", "config": {"name": "conv3_block2_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_block1_out", 0, 0, {}], ["conv3_block2_3_bn", 0, 0, {}]]]}, {"name": "conv3_block2_out", "class_name": "Activation", "config": {"name": "conv3_block2_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block2_add", 0, 0, {}]]]}, {"name": "conv3_block3_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block3_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block2_out", 0, 0, {}]]]}, {"name": "conv3_block3_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block3_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]]}, {"name": "conv3_block3_1_relu", "class_name": "Activation", "config": {"name": "conv3_block3_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]]}, {"name": "conv3_block3_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block3_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block3_1_relu", 0, 0, {}]]]}, {"name": "conv3_block3_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block3_2_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block3_2_conv", 0, 0, {}]]]}, {"name": "conv3_block3_2_relu", "class_name": "Activation", "config": {"name": "conv3_block3_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block3_2_bn", 0, 0, {}]]]}, {"name": "conv3_block3_3_conv", "class_name": "Conv2D", "config": {"name": "conv3_block3_3_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block3_2_relu", 0, 0, {}]]]}, {"name": "conv3_block3_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block3_3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block3_3_conv", 0, 0, {}]]]}, {"name": "conv3_block3_add", "class_name": "Add", "config": {"name": "conv3_block3_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_block2_out", 0, 0, {}], ["conv3_block3_3_bn", 0, 0, {}]]]}, {"name": "conv3_block3_out", "class_name": "Activation", "config": {"name": "conv3_block3_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block3_add", 0, 0, {}]]]}, {"name": "conv3_block4_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block4_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block3_out", 0, 0, {}]]]}, {"name": "conv3_block4_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block4_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]]}, {"name": "conv3_block4_1_relu", "class_name": "Activation", "config": {"name": "conv3_block4_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]]}, {"name": "conv3_block4_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block4_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block4_1_relu", 0, 0, {}]]]}, {"name": "conv3_block4_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block4_2_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block4_2_conv", 0, 0, {}]]]}, {"name": "conv3_block4_2_relu", "class_name": "Activation", "config": {"name": "conv3_block4_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block4_2_bn", 0, 0, {}]]]}, {"name": "conv3_block4_3_conv", "class_name": "Conv2D", "config": {"name": "conv3_block4_3_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block4_2_relu", 0, 0, {}]]]}, {"name": "conv3_block4_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block4_3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block4_3_conv", 0, 0, {}]]]}, {"name": "conv3_block4_add", "class_name": "Add", "config": {"name": "conv3_block4_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_block3_out", 0, 0, {}], ["conv3_block4_3_bn", 0, 0, {}]]]}, {"name": "conv3_block4_out", "class_name": "Activation", "config": {"name": "conv3_block4_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block4_add", 0, 0, {}]]]}, {"name": "conv3_block5_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block5_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block4_out", 0, 0, {}]]]}, {"name": "conv3_block5_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block5_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block5_1_conv", 0, 0, {}]]]}, {"name": "conv3_block5_1_relu", "class_name": "Activation", "config": {"name": "conv3_block5_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block5_1_bn", 0, 0, {}]]]}, {"name": "conv3_block5_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block5_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block5_1_relu", 0, 0, {}]]]}, {"name": "conv3_block5_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block5_2_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block5_2_conv", 0, 0, {}]]]}, {"name": "conv3_block5_2_relu", "class_name": "Activation", "config": {"name": "conv3_block5_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block5_2_bn", 0, 0, {}]]]}, {"name": "conv3_block5_3_conv", "class_name": "Conv2D", "config": {"name": "conv3_block5_3_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block5_2_relu", 0, 0, {}]]]}, {"name": "conv3_block5_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block5_3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block5_3_conv", 0, 0, {}]]]}, {"name": "conv3_block5_add", "class_name": "Add", "config": {"name": "conv3_block5_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_block4_out", 0, 0, {}], ["conv3_block5_3_bn", 0, 0, {}]]]}, {"name": "conv3_block5_out", "class_name": "Activation", "config": {"name": "conv3_block5_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block5_add", 0, 0, {}]]]}, {"name": "conv3_block6_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block6_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block5_out", 0, 0, {}]]]}, {"name": "conv3_block6_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block6_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block6_1_conv", 0, 0, {}]]]}, {"name": "conv3_block6_1_relu", "class_name": "Activation", "config": {"name": "conv3_block6_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block6_1_bn", 0, 0, {}]]]}, {"name": "conv3_block6_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block6_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block6_1_relu", 0, 0, {}]]]}, {"name": "conv3_block6_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block6_2_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block6_2_conv", 0, 0, {}]]]}, {"name": "conv3_block6_2_relu", "class_name": "Activation", "config": {"name": "conv3_block6_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block6_2_bn", 0, 0, {}]]]}, {"name": "conv3_block6_3_conv", "class_name": "Conv2D", "config": {"name": "conv3_block6_3_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block6_2_relu", 0, 0, {}]]]}, {"name": "conv3_block6_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block6_3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block6_3_conv", 0, 0, {}]]]}, {"name": "conv3_block6_add", "class_name": "Add", "config": {"name": "conv3_block6_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_block5_out", 0, 0, {}], ["conv3_block6_3_bn", 0, 0, {}]]]}, {"name": "conv3_block6_out", "class_name": "Activation", "config": {"name": "conv3_block6_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block6_add", 0, 0, {}]]]}, {"name": "conv3_block7_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block7_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, 